In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
labels = ['Felix','Hud','Abiral']
my_list = [1,4,5]
arr = np.array([1,4,5])
d = {'Felix':1,'Hud':4,'Abiral':5}

In [3]:
pd.Series(data=my_list)

0    1
1    4
2    5
dtype: int64

In [4]:
print("Familarity With Python")
pd.Series(data=my_list,index=labels)

Familarity With Python

Felix     1
Hud       4
Abiral    5
dtype: int64

In [5]:
pd.Series(data = arr)

0    1
1    4
2    5
dtype: int32

In [6]:
pd.Series(arr,labels)

Felix     1
Hud       4
Abiral    5
dtype: int32

In [7]:
ser = pd.Series(d)
ser

Felix     1
Hud       4
Abiral    5
dtype: int64

In [8]:
pd.Series(data=labels)

0     Felix
1       Hud
2    Abiral
dtype: object

In [9]:
ser['Hud']

4

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])        
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])     
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [13]:
ser1.add(ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [14]:
df = pd.DataFrame(randn(5,4),index=('A', 'B' ,'C','D','E'),columns='W X Y Z'.split())

In [15]:
df

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788
E -0.430598  1.159001  1.333901 -0.286063

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.724617  0.398746 -2.093707 -0.792237 -1.369090
B  0.590072  1.827843  1.226972 -0.360927  1.817044
C  0.574157 -0.443521  0.112462  0.494139  0.686619
D  1.702765  1.414641 -0.973074  0.128788  0.729691
E -0.430598  1.159001  1.333901 -0.286063  0.903303

In [19]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788
E -0.430598  1.159001  1.333901 -0.286063

In [20]:
df

          W         X         Y         Z       new
A  0.724617  0.398746 -2.093707 -0.792237 -1.369090
B  0.590072  1.827843  1.226972 -0.360927  1.817044
C  0.574157 -0.443521  0.112462  0.494139  0.686619
D  1.702765  1.414641 -0.973074  0.128788  0.729691
E -0.430598  1.159001  1.333901 -0.286063  0.903303

In [21]:
df.drop('new',axis=1,inplace=True)

In [22]:
df

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788
E -0.430598  1.159001  1.333901 -0.286063

In [23]:
df.drop('C',axis=0)

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
D  1.702765  1.414641 -0.973074  0.128788
E -0.430598  1.159001  1.333901 -0.286063

In [24]:
df

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788
E -0.430598  1.159001  1.333901 -0.286063

In [25]:
# df.loc?

In [26]:
df

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788
E -0.430598  1.159001  1.333901 -0.286063

In [27]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [28]:
df.loc['A']

W    0.724617
X    0.398746
Y   -2.093707
Z   -0.792237
Name: A, dtype: float64

In [29]:
df.loc['B','Y']

1.2269716734133174

In [30]:
df.loc[['A','B'],['W']]

          W
A  0.724617
B  0.590072

In [31]:
df.loc['A':'D','W':'Y']

          W         X         Y
A  0.724617  0.398746 -2.093707
B  0.590072  1.827843  1.226972
C  0.574157 -0.443521  0.112462
D  1.702765  1.414641 -0.973074

In [32]:
df.loc[df.W>0,:]

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788

In [33]:
df.loc[:,'Y']

A   -2.093707
B    1.226972
C    0.112462
D   -0.973074
E    1.333901
Name: Y, dtype: float64

In [34]:
df

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788
E -0.430598  1.159001  1.333901 -0.286063

In [35]:
df.iloc[2]

W    0.574157
X   -0.443521
Y    0.112462
Z    0.494139
Name: C, dtype: float64

In [36]:
df.iloc[[2,4],1]

C   -0.443521
E    1.159001
Name: X, dtype: float64

In [37]:
list(df.W >0)

[True, True, True, True, False]

In [38]:
df.iloc[list(df.W >0),:]

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788

In [39]:
df>0

       W      X      Y      Z
A   True   True  False  False
B   True   True   True  False
C   True  False   True   True
D   True   True  False   True
E  False   True   True  False

In [40]:
df[df>0]

          W         X         Y         Z
A  0.724617  0.398746       NaN       NaN
B  0.590072  1.827843  1.226972       NaN
C  0.574157       NaN  0.112462  0.494139
D  1.702765  1.414641       NaN  0.128788
E       NaN  1.159001  1.333901       NaN

In [41]:
df[df['W']>0]

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788

In [42]:
df

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
B  0.590072  1.827843  1.226972 -0.360927
C  0.574157 -0.443521  0.112462  0.494139
D  1.702765  1.414641 -0.973074  0.128788
E -0.430598  1.159001  1.333901 -0.286063

In [43]:
df[df['W']>0]['Y']

A   -2.093707
B    1.226972
C    0.112462
D   -0.973074
Name: Y, dtype: float64

In [44]:
df[df['W']>0][['Y','X']]

          Y         X
A -2.093707  0.398746
B  1.226972  1.827843
C  0.112462 -0.443521
D -0.973074  1.414641

In [45]:
df[(df['W']>0) & (df['Y'] <0)]

          W         X         Y         Z
A  0.724617  0.398746 -2.093707 -0.792237
D  1.702765  1.414641 -0.973074  0.128788

In [46]:
df.reset_index(inplace = True)

In [47]:
df

  index         W         X         Y         Z
0     A  0.724617  0.398746 -2.093707 -0.792237
1     B  0.590072  1.827843  1.226972 -0.360927
2     C  0.574157 -0.443521  0.112462  0.494139
3     D  1.702765  1.414641 -0.973074  0.128788
4     E -0.430598  1.159001  1.333901 -0.286063

In [48]:
df.set_index('index',inplace=True)

In [49]:
df

              W         X         Y         Z
index
A      0.724617  0.398746 -2.093707 -0.792237
B      0.590072  1.827843  1.226972 -0.360927
C      0.574157 -0.443521  0.112462  0.494139
D      1.702765  1.414641 -0.973074  0.128788
E     -0.430598  1.159001  1.333901 -0.286063

In [50]:
df = pd.DataFrame({'CE':[1,2,0],
                  'CS':[5,0,2],
                  'EE':[11,20,0],
                  'Pharmacy':[23,15,np.nan]},index=['C++','Math','Electrical'])

In [51]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0       NaN

In [52]:
df.dropna()

      CE  CS  EE  Pharmacy
C++    1   5  11      23.0
Math   2   0  20      15.0

In [53]:
df.dropna(axis=1)

            CE  CS  EE
C++          1   5  11
Math         2   0  20
Electrical   0   2   0

In [54]:
df.dropna(thresh=2)

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0       NaN

In [55]:
df.fillna(value='FILL VALUE')

            CE  CS  EE    Pharmacy
C++          1   5  11        23.0
Math         2   0  20        15.0
Electrical   0   2   0  FILL VALUE

In [56]:
df['Pharmacy'].fillna(value=df['Pharmacy'].mean(),inplace=True)

In [57]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0      19.0

In [58]:
data = {'Subject':['DBMS','DBMS','MCSC','MCSC','DIFF','DIFF'],
       'Instructor':['Santosh','Nabin','Gokul','Ram','Saraswoti','Khim'],
       'Assignments':[10,2,4,5,6,4]}

In [59]:
df = pd.DataFrame(data)
df

  Subject Instructor  Assignments
0    DBMS    Santosh           10
1    DBMS      Nabin            2
2    MCSC      Gokul            4
3    MCSC        Ram            5
4    DIFF  Saraswoti            6
5    DIFF       Khim            4

In [61]:
by_comp = df.groupby('Subject')
by_comp

In [62]:
by_comp.mean()

C:\Users\rosha\AppData\Local\Temp\ipykernel_14912\821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

         Assignments
Subject
DBMS             6.0
DIFF             5.0
MCSC             4.5

In [63]:
df.head()

  Subject Instructor  Assignments
0    DBMS    Santosh           10
1    DBMS      Nabin            2
2    MCSC      Gokul            4
3    MCSC        Ram            5
4    DIFF  Saraswoti            6